#Вводим с клаиватуры строку. Необходимо вывести строку, где развернём подстроку между первой и последней буквой "о" из исходной строки. 
# Если она только одна или её нет - то сообщить, что буква "о" - одна или не встречается.




def o_check(str):
    if str.find("о") == -1:
        print('буква "о" не встречается')
    elif str.find("о") == str.rfind("о"):
        print('буква "о" встречается 1 раз')
    else:
        print(str[str.find("о") + 1:str.rfind("о")])


o_check(input('Введите строку: '))